Revit 2026 API

# TabbedDialogExtensionOnCancelAction Property

---

The cancel handler.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TabbedDialogAction OnCancelAction { get; set; }
```
```vb
Public Property OnCancelAction As TabbedDialogAction
	Get
	Set
```
```cpp
public:
property TabbedDialogAction^ OnCancelAction {
	TabbedDialogAction^ get ();
	void set (TabbedDialogAction^ value);
}
```
```fsharp
member OnCancelAction : TabbedDialogAction with get, set
```

#### Property Value

TabbedDialogAction

This handler will be invoked when the "Cancel" button in Revit options dialog is clicked. The Revit options dialog will be closed directly if this property was set to .

#### Reference

TabbedDialogExtension Class

Autodesk.Revit.UI Namespace